package com.jy.platform.tuomin.tmworker;

import java.util.Arrays;
import java.util.HashMap;

import org.slf4j.Logger;
import org.slf4j.LoggerFactory;

import com.jy.platform.tuomin.Configuration;

/**
 * 姓名脱敏类
 * @author dell
 *
 */
public class PersonNameTMWorker {
	
	private static Logger logger = LoggerFactory.getLogger(PersonNameTMWorker.class);
	/**
	 * 偏移量，动态随机
	 */
	private static int offset = Configuration.getOffset();
	
	/**
	 * “姓”的映射
	 */
	private static final HashMap<Character, Character> xMap = new HashMap<Character, Character>();
	/**
	 * “名”的映射
	 */
	private static final HashMap<Character, Character> mMap = new HashMap<Character, Character>();

	/**
	 * 获取映射的新“姓”
	 * @param oldX 旧值
	 * @return 新值
	 */
	private static char getNewX(char oldX) {
		// 先从映射中查找，如果没有，则返回常用姓
		Character newX = xMap.get(oldX);
		if (newX != null) {
			return newX;
		} else {
			return cyxA[oldX % cyxA.length];
		}
	}
	
	/**
	 * 获取映射的新“名”
	 * @param oldM 旧值
	 * @return 新值
	 */
	private static char getNewM(char oldM) {
		// 先从映射中查找，如果没有，则返回常用名
		Character newM = mMap.get(oldM);
		if (newM != null) {
			return newM; 
		} else {
			return cymA[oldM % cymA.length];
		}
	}

	/**
	 * 根据姓名获取脱敏后的新姓名
	 * @param oldValue 原始姓名
	 * @return 脱敏后的姓名
	 */
	public static String getNewValue(String oldValue) {
		if (oldValue == null || oldValue.length() == 0) {
			return "";
		}
		StringBuilder sb = new StringBuilder();
		int len = Math.min(3, oldValue.length());
		for (int i=0; i<len; i++) {
			if (i==0)
				sb.append(getNewX(oldValue.charAt(0)));
			else
				sb.append(getNewM(oldValue.charAt(i)));
		}
		return sb.toString();
	}

	/**
	 * 排序后偏移做映射
	 */
	private static void init() {
		// “姓”的映射
		char[] bjxA = bjx.toCharArray();
		Arrays.sort(bjxA);
		int j = offset % bjxA.length == 0 ? 1 : offset % bjxA.length;
		for (int i=0; i < bjxA.length; i++) {
			xMap.put(bjxA[i], bjxA[j++]);
			if (j == bjxA.length) {
				j = 0;
			}
		}

		// “名”的映射
		char[] cyz2500A = cyz2500.toCharArray();
		Arrays.sort(cyz2500A);
		j = offset % cyz2500A.length == 0 ? 1 : offset % cyz2500A.length;
		for (int i=0; i< cyz2500A.length; i++) {
			mMap.put(cyz2500A[i], cyz2500A[j++]);
			if (j == cyz2500A.length) {
				j = 0;
			}
		}

		char[] cA = cyx.toCharArray();
		Arrays.sort(cA);
		for (int i=0; i<cyxA.length; i++) {
			cyxA[i] = cA[i];
		}
		
		cA = cym.toCharArray(); 
		Arrays.sort(cA);
		for (int i=0; i<cymA.length; i++) {
			cymA[i] = cA[i];
		}
		
		logger.info("姓名脱敏类初始化完毕");
	}

	/**
	 * 百家姓，列出了常用的姓氏
	 */
	private static final String bjx = "赵钱孙李周吴郑王" + "冯陈楮卫蒋沈韩杨" + "朱秦尤许何吕施张"
			+ "孔曹严华金魏陶姜" + "戚谢邹喻柏水窦章" + "云苏潘葛奚范彭郎" + "鲁韦昌马苗凤花方" + "俞任袁柳酆鲍史唐"
			+ "费廉岑薛雷贺倪汤" + "滕殷罗毕郝邬安常" + "乐于时傅皮卞齐康" + "伍余元卜顾孟平黄" + "和穆萧尹姚邵湛汪"
			+ "祁毛禹狄米贝明臧" + "计伏成戴谈宋茅庞" + "熊纪舒屈项祝董梁" + "杜阮蓝闽席季麻强" + "贾路娄危江童颜郭"
			+ "梅盛林刁锺徐丘骆" + "高夏蔡田樊胡凌霍" + "虞万支柯昝管卢莫" + "经房裘缪干解应宗" + "丁宣贲邓郁单杭洪"
			+ "包诸左石崔吉钮龚" + "程嵇邢滑裴陆荣翁" + "荀羊於惠甄麹家封" + "芮羿储靳汲邴糜松" + "井段富巫乌焦巴弓"
			+ "牧隗山谷车侯宓蓬" + "全郗班仰秋仲伊宫" + "宁仇栾暴甘斜厉戎" + "祖武符刘景詹束龙" + "叶幸司韶郜黎蓟薄"
			+ "印宿白怀蒲邰从鄂" + "索咸籍赖卓蔺屠蒙" + "池乔阴郁胥能苍双" + "闻莘党翟谭贡劳逄" + "姬申扶堵冉宰郦雍"
			+ "郤璩桑桂濮牛寿通" + "边扈燕冀郏浦尚农" + "温别庄晏柴瞿阎充" + "慕连茹习宦艾鱼容" + "向古易慎戈廖庾终"
			+ "暨居衡步都耿满弘" + "匡国文寇广禄阙东" + "欧殳沃利蔚越夔隆" + "师巩厍聂晁勾敖融" + "冷訾辛阚那简饶空"
			+ "曾毋沙乜养鞠须丰" + "巢关蒯相查后荆红" + "游竺权逑盖益桓公";

	/**
	 * 常用姓，如果在百家姓中不存在的，就分配一个常用姓
	 */
	private static final String cyx = "张王李赵刘";

	/**
	 * 2500个常用汉字，用于人名的映射
	 * 亡尸叉犬凶鸟穴死邪虫奸坟肝肚肠龟卵尿鸡驴丧厕肾肤肺肢肿胀狗盲哑胃虾蚁胆胸
	 * 脑狸狼畜蛇猪猫葬逼鼻骡嘴蹄蠢
	 */
	private static final String cyz2500 = "一乙" + "二十丁厂七卜人入八九几儿了力乃刀又"
			+ "三于干亏士工土才寸下大丈与万上小口巾山千乞川亿个勺久凡及夕丸么广" + "门义之弓己已子卫也女飞刃习马乡"
			+ "丰王井开夫天无元专云扎艺木五支厅不太区历尤友匹车巨牙屯比互切瓦"
			+ "止少日中冈贝内水见午牛手毛气升长仁什片仆化仇币仍仅斤爪反介父从今"
			+ "分乏公仓月氏勿欠风丹匀乌凤勾文六方火为斗忆订计户认心尺引丑巴孔" + "队办以允予劝双书幻"
			+ "玉刊示末未击打巧正扑扒功扔去甘世古节本术可丙左厉右石布龙平灭轧东"
			+ "卡北占业旧帅归且旦目叶甲申叮电号田由史只央兄叼叫另叨叹四生失禾丘"
			+ "付仗代仙们仪白仔他斥瓜乎丛令用甩印乐句匆册犯外处冬务包饥主市立"
			+ "闪兰半汁汇头汉宁它讨写让礼训必议讯记永司尼民出辽奶奴加召皮边发" + "孕圣对台矛纠母幼丝"
			+ "式刑动扛寺吉扣考托老执巩圾扩扫地扬场耳共芒亚芝朽朴机权过臣再协西"
			+ "压厌在有百存而页匠夸夺灰达列成夹轨划迈毕至此贞师尘尖劣光当早"
			+ "吐吓曲团同吊吃因吸吗屿帆岁回岂刚则肉网年朱先丢舌竹迁乔伟传乒乓"
			+ "休伍伏优伐延件任伤价份华仰仿伙伪自血向似后行舟全会杀合兆企众爷伞"
			+ "创肌朵杂危旬旨负各名多争色壮冲冰庄庆亦刘齐交次衣产决充妄闭问闯羊"
			+ "并关米灯州汗污江池汤忙兴宇守宅字安讲军许论农讽设访寻那迅尽导异孙" + "阵阳收阶阴防如妇好她妈戏羽观欢买红纤级约纪驰巡"
			+ "寿弄麦形进戒吞远违运扶抚坛技坏扰拒找批扯址走抄坝贡攻赤折抓扮抢孝"
			+ "均抛投抗坑坊抖护壳志扭块声把报却劫芽花芹芬苍芳严芦劳克苏杆杠杜"
			+ "材村杏极李杨求更束豆两丽医辰励否还歼来连步坚旱盯呈时吴助县里呆园"
			+ "旷围呀吨足邮男困吵串员听吩吹呜吧吼别岗帐财针钉告我乱利秃秀私每兵"
			+ "估体何但伸作伯伶佣低你住位伴身皂佛近彻役返余希坐谷妥含邻岔"
			+ "免狂犹角删条岛迎饭饮系言冻状亩况床库疗应冷这序辛弃冶忘闲间闷"
			+ "判灶灿弟汪沙汽沃泛沟没沈沉怀忧快完宋宏牢究穷灾良证启评补初社识诉"
			+ "诊词译君灵即层尾迟局改张忌际陆阿陈阻附妙妖妨努忍劲驱纯纱纳纲" + "驳纵纷纸纹纺纽"
			+ "奉玩环武青责现表规抹拢拔拣担坦押抽拐拖拍者顶拆拥抵拘势抱垃拉拦拌"
			+ "幸招坡披拨择抬其取苦若茂苹苗英范直茄茎茅林枝杯柜析板松枪构杰述枕"
			+ "或画卧事刺枣雨卖矿码奔奇奋态欧垄妻轰顷转斩轮软到非叔肯齿些虎"
			+ "虏贤尚旺具果味昆国昌畅明易昂典固忠咐呼鸣咏呢岸岩帖罗帜岭凯败贩"
			+ "购图钓制知垂牧物乖刮秆和季委佳侍供使例版侄侦侧凭侨佩货依的迫质欣"
			+ "征往爬彼径所舍金命斧爸采受乳贪念贫朋股肥服胁周昏鱼兔狐"
			+ "忽备饰饱饲变京享店夜庙府底剂郊废净放刻育闸闹郑券卷单炒炊炕炎"
			+ "炉沫浅法泄河沾泪油泊沿泡注泻泳泥沸波泼泽治怖性怕怜怪学宝宗定宜审"
			+ "宙官空帘实试郎诗肩房诚衬衫视话诞询该详建肃录隶居届刷屈弦承孟孤陕" + "降限妹姑姐姓始驾参艰线练组细驶织终驻驼绍经贯"
			+ "奏春帮珍玻毒型挂封持项垮挎城挠政赴赵挡挺括拴拾挑指垫挣挤拼挖按挥"
			+ "挪某甚革荐巷带草茧茶荒茫荡荣故胡南药标枯柄栋相查柏柳柱柿栏树要咸"
			+ "威歪研砖厘厚砌砍面耐耍牵残殃轻鸦皆背战点临览竖省削尝是盼眨哄显"
			+ "冒映星昨畏趴贵界虹思蚂虽品咽骂哗咱响哈咬咳哪炭峡罚贱贴骨钞"
			+ "钟钢钥钩卸缸拜看矩怎牲选适秒香种秋科重复竿段便俩贷顺修保促侮俭俗"
			+ "俘信皇泉鬼侵追俊盾待律很须叙剑逃食盆胜胞胖脉勉狭狮独狡狱狠贸怨"
			+ "急饶蚀饺饼弯将奖哀亭亮度迹庭疮疯疫疤姿亲音帝施闻阀阁差养美姜叛送"
			+ "类迷前首逆总炼炸炮烂剃洁洪洒浇浊洞测洗活派洽染济洋洲浑浓津恒恢恰"
			+ "恼恨举觉宣室宫宪突穿窃客冠语扁袄祖神祝误诱说诵垦退既屋昼费陡眉孩"
			+ "除险院娃姥姨姻娇怒架贺盈勇怠柔垒绑绒结绕骄绘给络骆绝绞统"
			+ "耕耗艳泰珠班素蚕顽盏匪捞栽捕振载赶起盐捎捏埋捉捆捐损都哲逝捡换挽"
			+ "热恐壶挨耻耽恭莲莫荷获晋恶真框桂档桐株桥桃格校核样根索哥速逗栗配"
			+ "翅辱唇夏础破原套逐烈殊顾轿较顿毙致柴桌虑监紧党晒眠晓鸭晃晌晕蚊哨"
			+ "哭恩唤啊唉罢峰圆贼贿钱钳钻铁铃铅缺氧特牺造乘敌秤租积秧秩称秘透笔"
			+ "笑笋债借值倚倾倒倘俱倡候俯倍倦健臭射躬息徒徐舰舱般航途拿爹爱颂翁"
			+ "脆脂胳脏胶逢留皱饿恋桨浆衰高席准座脊症病疾疼疲效离唐资凉"
			+ "站剖竞部旁旅阅羞瓶拳粉料益兼烤烘烦烧烛烟递涛浙涝酒涉消浩海涂浴"
			+ "浮流润浪浸涨烫涌悟悄悔悦害宽家宵宴宾窄容宰案请朗诸读扇袜袖袍被祥"
			+ "课谁调冤谅谈谊剥恳展剧屑弱陵陶陷陪娱娘通能难预桑绢绣验继"
			+ "球理捧堵描域掩捷排掉堆推掀授教掏掠培接控探据掘职基著勒黄萌萝菌菜"
			+ "萄菊萍菠营械梦梢梅检梳梯桶救副票戚爽聋袭盛雪辅辆虚雀堂常匙晨睁眯"
			+ "眼悬野啦晚啄距跃略累唱患唯崖崭崇圈铜铲银甜梨犁移笨笼笛符第敏做"
			+ "袋悠偿偶偷您售停偏假得衔盘船斜盒鸽悉欲彩领脚脖脸脱象够猜猎猛"
			+ "馅馆凑减毫麻痒痕廊康庸鹿盗章竟商族旋望率着盖粘粗粒断剪兽清添淋淹"
			+ "渠渐混渔淘液淡深婆梁渗情惜惭悼惧惕惊惨惯寇寄宿窑密谋谎祸谜逮敢屠" + "弹随蛋隆隐婚婶颈绩绪续骑绳维绵绸绿"
			+ "琴斑替款堪搭塔越趁趋超提堤博揭喜插揪搜煮援裁搁搂搅握揉斯期欺联散"
			+ "惹葛董葡敬葱落朝辜葵棒棋植森椅椒棵棍棉棚棕惠惑厨厦硬确雁殖裂"
			+ "雄暂雅辈悲紫辉敞赏掌晴暑最量喷晶喇遇喊景践跌跑遗蛙蛛蜓喝喂喘喉幅"
			+ "帽赌赔黑铸铺链销锁锄锅锈锋锐短智毯鹅剩稍程稀税筐等筑策筛筒答筋筝"
			+ "傲傅牌堡集焦傍储奥街惩御循艇舒番释禽腊脾腔鲁猾猴然馋装蛮就痛童阔"
			+ "善羡普粪尊道曾焰港湖渣湿温渴滑湾渡游滋溉愤慌惰愧愉慨割寒富窜窝窗" + "遍裕裤裙谢谣谦属屡强粥疏隔隙絮嫂登缎缓编骗缘"
			+ "瑞魂肆摄摸填搏塌鼓摆携搬摇搞塘摊蒜勤鹊蓝墓幕蓬蓄蒙蒸献禁楚想槐榆"
			+ "楼概赖酬感碍碑碎碰碗碌雷零雾雹输督龄鉴睛睡睬鄙愚暖盟歇暗照跨跳跪"
			+ "路跟遣蛾蜂嗓置罪罩错锡锣锤锦键锯矮辞稠愁筹签简毁舅鼠催傻像躲微愈"
			+ "遥腰腥腹腾腿触解酱痰廉新韵意粮数煎塑慈煤煌满漠源滤滥滔溪溜滚滨粱" + "滩慎誉塞谨福群殿辟障嫌嫁叠缝缠"
			+ "静碧璃墙撇嘉摧截誓境摘摔聚蔽慕暮蔑模榴榜榨歌遭酷酿酸磁愿需弊裳颗"
			+ "嗽蜻蜡蝇蜘赚锹锻舞稳算箩管僚魄貌膜膊膀鲜疑馒裹敲豪膏遮腐瘦辣竭" + "端旗精歉熄熔漆漂漫滴演漏慢寨赛察蜜谱嫩翠熊凳缩"
			+ "慧撕撒趣趟撑播撞撤增聪鞋蕉蔬横槽樱橡飘醋醉震霉瞒题暴瞎影踢踏踩踪"
			+ "蝶蝴嘱墨镇靠稻黎稿稼箱箭篇僵躺僻德艘膝膛熟摩颜毅糊遵潜潮懂额慰劈"
			+ "操燕薯薪薄颠橘整融醒餐器赠默镜赞篮邀衡膨雕磨凝辨辩糖糕燃澡激" + "懒壁避缴"
			+ "戴擦鞠藏霜霞瞧蹈螺穗繁辫赢糟糠燥臂翼骤" + "鞭覆蹦镰翻鹰" + "警攀蹲颤瓣爆疆" + "壤耀躁嚼嚷籍魔灌" + "霸露"
			+ "囊" + "罐"
			+ "湘";

	/**
	 * 常用名，名字的汉字超出2500个的范围后，从常用字中取
	 */
	private static final String cym = "明国华建文平志伟东海强晓生光林小民永杰军"; 
	
	/**
	 * 常用姓数组
	 */
	private static final char[] cyxA = new char[cyx.length()];
	
	/**
	 * 常用名数组
	 */
	private static final char[] cymA = new char[cym.length()];

	/**
	 * 初始化
	 */
	static {
		init();
	}
	
	public static void main(String[] args) {
		System.out.println("张羽=" + getNewValue("张羽"));
		System.out.println("彭刘湘=" + getNewValue("彭刘湘"));
		System.out.println("董继亘=" + getNewValue("董继亘"));
		System.out.println("乔家伟=" + getNewValue("乔家伟"));
		System.out.println("许广欣=" + getNewValue("许广欣"));
		System.out.println("韩红=" + getNewValue("韩红"));
		System.out.println("山本五十=" + getNewValue("山本五十"));
		System.out.println("John=" + getNewValue("John"));
	}
}
